Repository: hodanovich-irina/TicketManagement
Catalog: src/TicketManagement.Presentation/Resources/Views/Home/ErrorMessage.*.resx
Languages: be_by, ru

source: Area was null
be_by: Зона была нулявая
ru: Площадь была нулевой

source: Coordinates must be more than zero
be_by: Каардынаты павінны быць больш за нуль
ru: Координаты должны быть больше нуля

source: Description of area must be less than 200 and must be not null
be_by: Апісанне залы павінна быць менш за 200 і не павінна быць нулявой
ru: Описание области должно быть меньше 200 и не должно быть пустым.

source: Description of event must be not null
be_by: Апісанне падзеі не павінно быць нулявым
ru: Описание события не должно быть нулевым.

source: Description of layout must be less than 120 sumbols and must be not null
be_by: Апісанне залы павінно быць менш за 120 знакаў і не павінна быць нулявой
ru: Описание зала должно содержать менее 120 символов и не должно быть нулевым.

source: Event area was null
be_by: Зона мерапрыемства была нулявая
ru: Зона события не указана.

source: Event seat was null
be_by: Сядушка для мерапрыемства была нулевой
ru: Сидения на мероприятие не указано

source: Event was null
be_by: Мерапрыемства было нулявым
ru: Событие было нулевым

source: Id must be more than zero
be_by: Ідэнтыфікатар павінен быць больш за нуль
ru: Идентификатор должен быть больше нуля

source: Image url of event must be not null
be_by: URL-адрас малюнка падзеі не павінен быць нулявым
ru: URL-адрес изображения события не должен быть нулевым.

source: Incorrect data
be_by: Няправільныя дадзеныя
ru: Неверные данные

source: Layout was null
be_by: Зала была нулявой
ru: Зал был нулевым

source: Name of event must be less than 120 sumbols and must be not null
be_by: Назва падзеі павінна быць менш за 120 і не павінна быць нулявой
ru: Название события должно содержать менее 120 символов и не должно быть нулевым.

source: Name of layout must be less than 120 sumbols and must be not null
be_by: Назва залы павінна быць менш за 120 знакаў і не павінна быць нулявой
ru: Имя зала должно содержать менее 120 символов и не должно быть нулевым.

source: No access
be_by: Доступ забаронены
ru: Доступ запрещён

source: Number and row of seat must be more than zero
be_by: Нумар і шэраг сядзенняў павінны быць больш за нуль
ru: Номер и ряд сидений должны быть больше нуля

source: Phone of venue must be less than 30
be_by: Тэлефон месца правядзення павінен быць менш за 30
ru: Телефон места проведения должен быть меньше 30 символов

source: Price must be more than zero
be_by: Цана павінна быць больш за нуль
ru: Цена должна быть больше нуля

source: Seat was null
be_by: Сядзенне было нулявым
ru: Место было пустым

source: Show time of event must be more than zero
be_by: Час паказу падзеі павінен быць больш за нуль
ru: Время показа события должно быть больше нуля

source: Ticket was null
be_by: Білет быў нулявы
ru: Показать время события должно Билет был нулевым

source: User was null
be_by: Карыстальнік быў нуль
ru: Пользователь был нулевым

source: Warning! Events from the file are not added or not all are added...
be_by: Папярэджанне! Падзеі з файла не дададзены ці дададзены не ўсе...
ru: Предупеждение! События из файла не добавлены или добавлены не все...

source: You can't add a new area. This area description alredy exist in this layout
be_by: Вы не можаце дадаць новую зону. Гэта апісанне зоны ўжо існуе ў гэтай зале.
ru: Вы не можете добавить новую зону. Описание этой зоны уже существует в этом зале

source: You can't add a new layuot. Layout with this name alredy exist in this venue
be_by: Вы не можаце дадаць новую залу. Зала з такой назвай ужо існуе ў гэтым месцы
ru: Вы не можете добавить новый зал. Зал с таким названием уже существует в этом месте

source: You can't add a new seat. Seat with this row and number alredy exsist in this area
be_by: Вы не можаце дадаць новае месца. Месца з гэтым шэрагам і нумарам ужо існуюць у гэтай вобласці
ru: Вы не можете добавить новое место. Место с этим рядом и номером уже существует в этой зоне

source: You can't add a new venue. This venue name alredy exist
be_by: Вы не можаце дадаць новае месца. Гэтая назва месца ўжо існуе
ru: Вы не можете добавить новое место. Это место уже существует

source: You can't buy ticket for event. This seat is booked
be_by: Вы не можаце купіць квіток на мерапрыемства. Гэта месца забраніравана
ru: Вы не можете купить билет на мероприятие. Это место забронировано

source: You can't create area for event without event
be_by: Вы не можаце стварыць зону для мерапрыемства без мерапрыемства
ru: Вы не можете создать зону для события без события

source: You can't create event in tha past!
be_by: Вы не можаце стварыць падзею ў мінулым!
ru: Вы не можете создать событие в прошлом!

source: You can't create event. Date of end should be more than date of start
be_by: Вы не можаце стварыць падзею. Дата заканчэння павінна быць больш, чым дата пачатку
ru: Вы не можете создать событие. Дата окончания должна быть больше даты начала

source: You can't create event. Event on this period alredy exsist in venue!
be_by: Вы не можаце стварыць падзею. Мерапрыемства ў гэты перыяд ужо існуе на месцы!
ru: Вы не можете создать событие. Мероприятие на этот период уже существует в этом месте!

source: You can't create seat for event without event
be_by: Вы не можаце стварыць месца для мерапрыемства без мерапрыемства
ru: Вы не можете создать место для мероприятия без мероприятия

source: You can't delete booked seat
be_by: Вы не можаце выдаліць забраніраванае месца
ru: Вы не можете удалить забронированное место

source: You can't delete event area. Any seats booked
be_by: Вы не можаце выдаліць вобласць падзей. Забраніраваныя някаторыя месцы
ru: Вы не можете удалить зону события. Некоторые места забронированы

source: You can't delete event. Any seats booked
be_by: Вы не можаце выдаліць падзею. Забраніраваныя някаторыя месцы
ru: Вы не можете удалить событие. Некоторые места забронированы

source: You can't delete layout. Any seats booked
be_by: Вы не можаце выдаліць зал. Забраніраваныя някаторыя месцы
ru: Вы не можете удалить макет. Некоторые места забронированы

source: You can't delete seat. Incorrect data
be_by: Вы не можаце выдаліць месца. Няправільныя дадзеныя
ru: Вы не можете удалить место. Неверные данные.

source: You can't delete venue. Any seats booked
be_by: Вы не можаце выдаліць месца правядзення. Забраніраваныя някаторыя месцы
ru: Вы не можете удалить место проведения. Некоторые места забронированы

source: You can't edit a layuot. Layout with this name alredy exist in this venue
be_by: Вы не можаце рэдагаваць залу. Зала з такой назвай ужо існуе ў гэтым месцы
ru: Вы не можете редактировать зал. Зал с таким названием уже существует в этом месте

# You can't edit event in tha past!
source: You can't edit event in the past!
be_by: Вы не можаце рэдагаваць падзею ў мінулым!
ru: Вы не можете редактировать событие в прошлом!

source: You can't edit event. Date of end should be more than date of start
be_by: Вы не можаце рэдагаваць падзею. Дата заканчэння павінна быць больш, чым дата пачатку
ru: Вы не можете редактировать событие. Дата окончания должна быть больше даты начала

source: You can't edit event. Event on this period alredy exsist in venue!
be_by: Вы не можаце рэдагаваць падзею. Мерапрыемства ў гэты перыяд ужо існуе на месцы!
ru: Вы не можете редактировать событие. Мероприятие на этот период уже существует в этом месте!

source: You can't edit this area. This area description alredy exist in this layout
be_by: Вы не можаце рэдагаваць гэтую зону. Гэта апісанне зоны ўжо існуе ў гэтай зале
ru: Вы не можете редактировать эту зону. Описание этой зоны уже существует в этом зале.

source: You can't edit this seat. Seat with this row and number alredy exist in this area
be_by: Вы не можаце рэдагаваць гэта месца. Месца з гэтым шэрагам і нумарам ужо існуе ў гэтай вобласці
ru: Вы не можете редактировать это место. Место с этим рядом и номером уже существует в этой зоне

source: You can't edit this seat. Seat with this row and number alredy exist in this event area
be_by: Вы не можаце рэдагаваць гэта месца. Месца з гэтым шэрагам і нумарам ужо існуе ў гэтай вобласці падзей
ru: Вы не можете редактировать это место. Место с этим рядом и номером уже существует в этой области мероприятия.

source: You can't edit ticket. If you want buy any ticket, delete this ticket and add another one.
be_by: Вы не можаце рэдагаваць білет. Калі вы хочаце купіць які-небудзь білет, выдаліце ​​гэты білет і дадайце яшчэ адзін.
ru: Вы не можете редактировать билет. Если вы хотите купить другой билет, удалите этот билет и добавьте другой.

source: You can't edit venue. This venue name alredy exist
be_by: Вы не можаце рэдагаваць месца правядзення. Гэтая назва месца ўжо існуе
ru: Вы не можете изменить место проведения. Место с таким названием уже существует
